## Import pandas

In [13]:
import pandas as pd

## Load Data

In [73]:
df_dev = pd.read_excel("data_dev.xlsx")
df_dev

   developer_id     name  age  salary        country       city   level
0             1   Thomas   36   60000        Germany     Berlin  Senior
1             2   Lothar   48   90000        Germany     Munich  Senior
2             3   Andrew   21   50000  United States     Boston  Junior
3             4  Bastian   30   40000        Germany     Munich  Junior
4             5     John   44  120000       Scotland  Edinburgh  Senior
5             6     Elon   18   90000  United States   New York  Junior
6             7    Steve   27  110000  United States   New York  Junior

In [71]:
df_dev.to_excel("data_dev.xlsx", index=False)

## Pivot 1

In [77]:
df_pivot = df_dev.pivot_table(
    index=['country', 'city'], 
    columns='level',
    values='salary', 
    aggfunc='mean',
    fill_value=0
)

df_pivot = pd.DataFrame(df_pivot)
df_pivot

level                    Junior  Senior
country       city
Germany       Berlin          0   60000
              Munich      40000   90000
Scotland      Edinburgh       0  120000
United States Boston      50000       0
              New York   100000       0

## Pivot 2

In [76]:
df_pivot = df_dev.pivot_table(
    index=['country', 'city'], 
    values=['age', 'salary'], 
    aggfunc='mean'
)

df_pivot = pd.DataFrame(df_pivot)
df_pivot

                          age  salary
country       city
Germany       Berlin     36.0   60000
              Munich     39.0   65000
Scotland      Edinburgh  44.0  120000
United States Boston     21.0   50000
              New York   22.5  100000

## Pivot 3

In [75]:
df_pivot = df_dev.pivot_table(
    index=['country', 'city'], 
    aggfunc={'developer_id': len, 'age': 'mean', 'salary': sum}
)
df_pivot = df_pivot.rename(columns={
    'age': 'age_mean',
    'salary': 'salary_sum',
    'developer_id': 'devs_number',
})
df_pivot = df_pivot[['devs_number', 'age_mean', 'salary_sum']]
df_pivot = pd.DataFrame(df_pivot)
df_pivot

                         devs_number  age_mean  salary_sum
country       city
Germany       Berlin               1      36.0       60000
              Munich               2      39.0      130000
Scotland      Edinburgh            1      44.0      120000
United States Boston               1      21.0       50000
              New York             2      22.5      200000